SIMISA@@@@@@@@@@JINX0D0t______

Wagon ( BR_DMBS51661  
 comment( BR Class 115 DMU )
 Type ( Engine )
 WagonShape ( BR_DMBS51661.s )
 
 comment( real: 10ft+3in 15ft+5in 75ft+2in )
 Size ( 2.71m 3.9774m 19.9m )
 comment( 420k lb is the maximum )
 Mass ( 36t )
 WheelRadius ( 47.25in/2 )
 InertiaTensor ( Box( 2.71m 3.864m 19.9m ) )
 Coupling (
  Type ( Chain )
  Spring (
   Stiffness ( 1e6N/m 5e6N/m )
   Damping ( 1e6N/m/s 1e6N/m/s )
   Break ( 2e8N 2e8N )
   r0 ( 20cm 30cm )
  )
  CouplingHasRigidConnection ()
  Velocity ( 0.1m/s )
 )
 Buffers (
  Spring (
   Stiffness ( 1e6N/m 5e6N/m )
   Damping ( 1e6N/m/s 1e6N/m/s )
   r0 ( 0m 1e9 )
  )
  Centre ( 0.5 )
  Radius ( 1.05 )
  Angle ( 0.5deg )
 )

 Adheasion ( 0.2 0.4 2 0 )
 DerailRailHeight ( 4cm )
 DerailRailForce ( 2.5*212.5t )
 DerailBufferForce ( 500kN )
 NumWheels ( 8 )
 Friction (
  100N/m/s  1  -1mph  0  1
  5.1N/rad/s  1  -1rad/s  0  1
 )
 
 Inside (
            PassengerCabinFile ( cravpassview.s )
            PassengerCabinHeadPos ( 0.96 2.5515 1.23 )
            RotationLimit ( 30 70 0 )
            StartDirection ( 0 0 0 )
     Sound ( "cravenscab.sms" )

 )

 
 AntiSlip ()

 BrakeEquipmentType( "Vacuum_brake, Handbrake, Auxilary_reservoir" )
 BrakeSystemType( "Vacuum_single_pipe" )
 MaxBrakeForce( 40kN )


 NumberOfHandbrakeLeverSteps( 100 )
 
        MaxReleaseRate( 10 )
        MaxApplicationRate( 10 )
        MaxAuxilaryChargingRate( 10 )
        BrakeCylinderPressureForMaxBrakeBrakeForce( 21 )        



 IntakePoint ( 3.33 0.4 FuelDiesel )

 PassengerCapacity ( 60.0 )


 Lights ( 14
  Light (
  comment( Sphere of light )
  Type ( 1 )
  Conditions (
  Headlight ( 3 )
  Unit ( 2 )
  )
  Cycle ( 0 )
  FadeIn ( 0.5 )
  FadeOut ( 0.5 )
  States ( 1
  State ( 
  Duration ( 0.0 )
  LightColour ( 80ccffff )  
  Position ( 0 1.89 10 )
Transition ( 0 )
Radius ( 157.5 )
Angle ( 18.0 )
)
)
)
Light (
comment( Marker Light Dim Left )
Type ( 0 )
Conditions (
Headlight ( 2 )
Unit ( 2 )
)
FadeIn ( 0.5 )
FadeOut ( 0.5 )
Cycle ( 0 )
States ( 1
State (
Duration ( 0.0 )
LightColour ( ffff9900 )
Position ( 0.73 1.785 9.78 )
Azimuth ( 0 0 0 )
Transition ( 0 )
Radius ( 0.315 )
Elevation ( 0 0 0 )
)
)
)
Light (
comment( Marker Light Bright Left )
Type ( 0 )
Conditions (
Headlight ( 3 )
Unit ( 2 )
)
FadeIn ( 0.5 )
FadeOut ( 0.5 )
Cycle ( 0 )
States ( 1
State (
Duration ( 0.0 )
LightColour ( ffff9900 )
Position ( 0.73 1.785 9.78 )
Azimuth ( 0 0 0 )
Transition ( 0 )
Radius ( 0.315 )
Elevation ( 0 0 0 )
)
)
)
Light (
comment( Marker Light Dim Right )
Type ( 0 )
Conditions (
Headlight ( 2 )
Unit ( 2 )
)
FadeIn ( 0.5 )
FadeOut ( 0.5 )
Cycle ( 0 )
States ( 1
State (
Duration ( 0.0 )
LightColour ( ffff9900 )
Position ( -0.73 1.785 9.78 )
Azimuth ( 0 0 0 )
Transition ( 0 )
Radius ( 0.315 )
Elevation ( 0 0 0 )
)
)
)
Light (
comment( Marker Light Bright Right )
Type ( 0 )
Conditions (
Headlight ( 3 )
Unit ( 2 )
)
FadeIn ( 0.5 )
FadeOut ( 0.5 )
Cycle ( 0 )
States ( 1
State (
Duration ( 0.0 )
LightColour ( ffff9900 )
Position ( -0.73 1.785 9.78 )
Azimuth ( 0 0 0 )
Transition ( 0 )
Radius ( 0.315 )
Elevation ( 0 0 0 )
)
)
)
Light (
comment( Centre Light )
Type ( 0 )
Conditions (
Headlight ( 3 )
Unit ( 2 )
)
FadeIn ( 0.5 )
FadeOut ( 0.5 )
Cycle ( 0 )
States ( 1
State (
Duration ( 0.0 )
LightColour ( ffffffff )
Position ( 0 1.659 9.85 )
Azimuth ( 0 0 0 )
Transition ( 0 )
Radius ( 0.7875 )
Elevation ( 0 0 0 )
)
)
)
Light (
comment( Rear Light Left )
Type ( 0 )
Conditions (
Headlight ( 3 )
Unit ( 3 )
)
FadeIn ( 0.5 )
FadeOut ( 0.5 )
Cycle ( 0 )
States ( 1
State (
Duration ( 0.0 )
LightColour ( 80ff0000 )
Position ( 0.73 1.785 9.78 )
Azimuth ( 0 0 0 )
Transition ( 0 )
Radius ( 0.315 )
Elevation ( 0 0 0 )
)
)
)
Light (
comment( Rear Light Right )
Type ( 0 )
Conditions (
Headlight ( 3 )
Unit ( 3 )
)
FadeIn ( 0.5 )
FadeOut ( 0.5 )
Cycle ( 0 )
States ( 1
State (
Duration ( 0.0 )
LightColour ( 80ff0000 )
Position ( -0.73 1.785 9.78 )
Azimuth ( 0 0 0 )
Transition ( 0 )
Radius ( 0.315 )
Elevation ( 0 0 0 )
)
)
)
Light (
comment( Rear Light Right )
Type ( 0 )
Conditions (
Headlight ( 2 )
Unit ( 3 )
)
FadeIn ( 0.5 )
FadeOut ( 0.5 )
Cycle ( 0 )
States ( 1
State (
Duration ( 0.0 )
LightColour ( 80ff0000 )
Position ( -0.73 1.785 9.78 )
Azimuth ( 0 0 0 )
Transition ( 0 )
Radius ( 0.315 )
Elevation ( 0 0 0 )
)
)
)
Light (
comment( Rear Light Left )
Type ( 0 )
Conditions (
Headlight ( 2 )
Unit ( 3 )
)
FadeIn ( 0.5 )
FadeOut ( 0.5 )
Cycle ( 0 )
States ( 1
State (
Duration ( 0.0 )
LightColour ( 80ff0000 )
Position ( 0.73 1.785 9.78 )
Azimuth ( 0 0 0 )
Transition ( 0 )
Radius ( 0.315 )
Elevation ( 0 0 0 )
)
)
)
Light (
comment( Sphere of light AI )
Type ( 1 )
Conditions (
Headlight ( 0 )
Unit ( 2 )
Control ( 1 )
Service ( 2 )
TimeOfDay ( 2 )
Weather ( 0 )
)
Cycle ( 0 )
FadeIn ( 0.5 )
FadeOut ( 0.5 )
States ( 1
State (
Duration ( 0.0 )
LightColour ( ffffffff )
Position ( 0 1.7325 9.78 )
Transition ( 0 )
Radius ( 105 )
Angle ( 10.0 )
)
)
)
Light (
comment( Head Light AI )
Type ( 0 )
Conditions (
Headlight ( 0 )
Unit ( 2 )
Control ( 1 )
Service ( 2 )
TimeOfDay ( 2 )
Weather ( 0 )
)
FadeIn ( 0.5 )
FadeOut ( 0.5 )
Cycle ( 0 )
States ( 1
State (
Duration ( 0.0 )
LightColour ( ffffffff )
Position ( 0 1.575 9.78 )
Azimuth ( 0 0 0 )
Transition ( 0 )
Radius ( 0.525 )
Elevation ( 0 0 0 )
)
)
)
Light (
comment( Marker Light Dim Right AI )
Type ( 0 )
Conditions (
Headlight ( 0 )
Unit ( 2 )
Control ( 1 )
Service ( 2 )
TimeOfDay ( 2 )
Weather ( 0 )
)
FadeIn ( 0.5 )
FadeOut ( 0.5 )
Cycle ( 0 )
States ( 1
State (
Duration ( 0.0 )
LightColour ( ffff9900 )
Position ( -0.85 1.7325 9.78 )
Azimuth ( 0 0 0 )
Transition ( 0 )
Radius ( 0.315 )
Elevation ( 0 0 0 )
)
)
)
Light (
comment( Marker Light Dim Left AI )
Type ( 0 )
Conditions (
Headlight ( 0 )
Unit ( 2 )
Control ( 1 )
Service ( 2 )
TimeOfDay ( 2 )
Weather ( 0 )
)
FadeIn ( 0.5 )
FadeOut ( 0.5 )
Cycle ( 0 )
States ( 1
State (
Duration ( 0.0 )
LightColour ( ffff9900 )
Position ( 0.85 1.7325 9.78 )
Azimuth ( 0 0 0 )
Transition ( 0 )
Radius ( 0.315 )
Elevation ( 0 0 0 )
)
)
)
)


 Sound ( "..\\..\\Kiha31\\Sound\\K31eng.sms" )
)

Engine ( BR_DMBS51661

 Effects
 (
  DieselSpecialEffects
  (
   comment
   (
    the format of these little blocks is as follow:

    offset.x offset.y offset.z
    normal.x normal.y normal.z
    width in metres

    defining the offset from the shape pivot point
    where steam / smoke should appear, the direction
    it should go and the width of the nozzle
   )

   Exhaust1
   (
                                0.6 4.104597 -9.7
    .2 .3 0
    0.1
   )
   Exhaust2
   (
                                -0.6 4.104597 -9.7
    .2 .3 0
    0.1
   )

  )
 )

 Wagon ( BR_DMBS51661 )
 Type ( Diesel )
 MaxPower ( 350kW )
 MaxForce ( 170kN )
 MaxContinuousForce ( 145kN )
 MaxVelocity ( 70mph )
 WheelRadius ( 23.625in )
 comment( sanding system is switched off when faster than given velocity )
 Sanding ( 10mph )
 NumWheels ( 8 )
 MaxTemperature ( 120 )
 MaxOilPressure ( 90 )
 MaxDieselLevel( 500gals )

 TrainBrakesControllerMaxReleaseRate( 12 )
 TrainBrakesControllerMinSystemPressure( 0 )
 TrainBrakesControllerMaxSystemPressure( 21 )

 EngineBrakesControllerHasProportionalBrake( 1 )
        EngineBrakesProportionalBrakeLag( 0.9 )

 BrakesEngineBrakeType( "Vacuum_single_pipe"  )
 BrakesTrainBrakeType( "Vacuum_single_pipe" )
        BrakesEngineControllers( "Hand, Train" )

 
 CabView ( DMUGen1c.cvf )
 MaxDieselLevel ( 500gal )
 DieselUsedPerHourAtMaxPower ( 15gal )
 DieselUsedPerHourAtIdle ( 5gal )

 DieselSmokeEffectInitialMagnitude( 0.2 )
 DieselSmokeEffectMaxMagnitude( 1 )
 DieselSmokeEffectInitialSmokeRate( 0.1 )
 DieselSmokeEffectMaxSmokeRate( 0.6 )

 DieselEngineIdleRPM( 150 )
 DieselEngineMaxRPM( 1500 )
 DieselEngineSpeedOfMaxTractiveEffort( 20mph )
 DieselEngineMaxRPMChangeRate( 50 )

 DieselEngineType( hydraulic )

 GearBoxNumberOfGears( 4 )
 GearBoxDirectDriveGear( 4 )
 GearBoxMaxSpeedForGears(17.5 28 45 70 )
 GearBoxMaxTractiveForceForGears(35000N 21875N 13650N 8750N )
 GearBoxOverspeedPercentageForFailure( 170 )
 GearBoxBackLoadForce( 4500 )
 GearBoxCoastingForce( 2000 )
 GearBoxUpGearProportion( 0.85 )
 GearBoxDownGearProportion( 0.35 )
 GearBoxOperation( manual )
 GearBoxEngineBraking( direct_drive )
   


 DoesHornTriggerBell( 0 )
 
 comment( infinate sanding time )
 MaxSandingTime( -1 )

  
      EngineControllers (
  Throttle ( 0 1 0.04 0
  NumNotches ( 1
  Notch( 0 1 Dummy )

                )
            )
           
           Brake_Train ( 0 1 0.01 0.65 
                NumNotches( 3
                    Notch(0     1 TrainBrakesControllerReleaseStart )
                    Notch(0.4   1 TrainBrakesControllerRunningStart )
                    Notch(0.5   1 TrainBrakesControllerApplyStart )

                )
            )

            EngineBrakingButton( 0 1 0 )
            DirControl ( -1 0 1 1 )
            BellToggle( 0 1 0 )
            AWS ( 0 1 0 )
            Sanding ( 0 1 0 )
            Horn ( 0 1 0 )
            Wipers ( 0 1 0 )
            Gear( 0 4 1 0
                NumNotches ( 5 
                 Notch ( 0         0 Dummy )
                 Notch ( 1         0 Dummy )
                 Notch ( 2         0 Dummy )
   Notch ( 3         0 Dummy )
   Notch ( 4         0 Dummy )
                )
            )
            Vigilance ( 0 1 0 )
            Headlights ( 0 0.25 1 0 )
        )


 comment( fuel_level )
 EngineVariables ( 5300 )
 Sound ( "..\\..\\Kiha31\\Sound\\K31cab.sms" )

  Name ( "BR Class 115 DMBS no. 51661" )
  Description (
 "Built in 1962 by British Railways at Derby for use either as a three-car set (DMBS-TCL-DMBS) or as a four-car set (DMBS-TS-TCL-DMBS)."+
 "The former were gangway fitted, and were allocated to Allerton, whilst the latter sets were allocated to London Marylebone for use on the 'Chiltern Line'."+
 "Locomotive type: Class 115\n\n"+
 "Power: 2 x 150 hp power cars\n\n"+
 "Max. speed: 70 mph (110 km/h)\n\n"+
 "Mechanical gearbox\n\n"+
 "Power source: Diesel engine\n\n"+
 "Alternator: Not Applicable\n\n"+
 "Traction motors: N/A \n\n"+
 "Max. starting tractive effort: Not a lot lb \n\n"+
 "Max. continuous tractive effort: Even less lb \n\n"+
 "Wheel configuration: Eight 45-inch (114 cm) diameter in BO-BO configuration (two sets of two "+
 "driven axles)\n\n"+
 "Height: 12 ft. 9 in. (3.88m )\n\n"+
 "Width: 8 ft. 3 in. (2.17 m )\n\n"+
 "Length: 63 ft. 6 in. (18.79 m)\n\n"+
 "Weight: 35 tons " 

  )
  EngineOperatingProcedures (
 "To move forward\n"+
 "1. Press Shift+E if necessary to move the Speed Gear handle to neutral.\n"+
 "2. Hold down the A key as necessary to move the Throttle to 0%.\n"+
 "3. Press the W key to move the Reverser to Forward.\n"+
 "4. Press E to move the Speed Gear handle to 1.\n"+
 "5. Hold down the ; (SEMICOLON) key to release the train brakes.\n"+
 "6. Press the D key to move increase the Throttle setting.\n"+  
 "7. Increase the gear with E as necessary\n\n"+
 "To slow the train\n"+
 "1. Press the A key to move the Throttle to a lower setting.\n"+
 "2. Use the brakes to further reduce speed if desired.\n\n"+
 "To apply the train brakes\n"+
 "1. Hold down the ' (APOSTROPHE) key.\n\n"+
 "To release the train brakes\n"+
 "1. Hold down the ; (SEMICOLON) key.\n\n"+
 "To back up\n"+
 "1. Bring your train to a full stop.\n"+
 "2. Hold down the A key to move the Throttle to 0%.\n"+
 "3. Press Shift+E to move the Speed Gear handle to Neutral.\n"+
 "4. Press the S key twice to move the Reverser to the Reverse position.\n"+
 "5. Press the ; [SEMICOLON] key to release the brakes.\n"+
 "6. Press E to move the Speed Gear handle to 1.\n"+
 "7. Press the D key to slowly advance the Throttle.\n\n"+
 "To load and unload passengers\n"+
 "1. Stop at a station.\n"+
 "2. Press the Enter key.\n"+
 "3. Wait for the \"permission to depart\" buzzer.\n"+
 "TIP: Use the Next Station driving aid (F10) to monitor loading and unloading.\n\n"+
 "To couple to a car or locomotive\n"+
 "1. Coast into the unit at a very slow speed, about 4 km/h.\n"+
 "Tip: To use the Coupling view, press the 6 key.\n"+
 "2. Press F9 to open the Train Operations window.\n"+
 "3. If the icon for the unit you coupled to is red, the handbrake is on. Double-click the car to release the handbrake.\n"+
 "4. Close the Train Operations window.\n\n"+
 "To uncouple from a car or locomotive\n"+
 "1. Press F9 to open the Train Operations window.\n"+
 "2. Double-click a unit in the part of the train you want to uncouple from the locomotive, to set the handbrake.\n"+
 "3. Double-click the coupler between the units you want to uncouple and the rest of the train.\n"+
 "4. Close the Train Operations window."
 ) )